---
kind: property
id: P:Autodesk.Revit.DB.OBJExportOptions.TargetUnit
source: html/a0ae7667-641a-f729-329b-706460172df4.htm
---
# Autodesk.Revit.DB.OBJExportOptions.TargetUnit Property

The unit type of geometry in the resultant OBJ file.
 Default value is ExportUnit::Default.

## Syntax (C#)
```csharp
public ExportUnit TargetUnit { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration